data_question_answer = {
    '1':
        {'question': """Стоимость обучения❓""",
         'answer': "-Наставничество стоит 2000 сом но эта сумма только\n"
                   "за обучение,на старт у вас должно быть минимум 500 сомов.\n"
                   "Курс будет длиться 3 дня.(есть задания и схемы по которым вы будете обучаться).📚"},
    '2':
        {'question': """Есть ли гарантия на прибыль❓""",
         'answer': """Гарантия 100%,прибыль будет, при правильном понимании схемы и указании наставника.✅"""},
    '3':
        {'question': """Сколько мы на этом заработали❓""",
         'answer': "Ответ просто,так как наша организация коммерческая мы не даем отчёты на нашу прибыль.\n"
                   "Но прибыль у нас большая,растёт с каждым днём.🤫💰"},
    '4':
        {'question': """Что потребуется для начала❓""",
         'answer':  "📍Для начала тебе нужен лишь (смартфон,ноутбук,компьютер и тд) одно из перечисленных.\n"
                    "📍Хорошая сеть.\n"
                    "📍Быстрый интернет.\n"
                    "📍Твоя внимательность и ум.💡"},
    '5':
        {'question': """Сколько можно заработать в день❓""",
         'answer': "В день обычно делают … сомов.✅\n"
                   "Но об этом поговорим при условии если ты уверен в себе\n"
                   "и хочешь заработать денег используя только свой мозг.💴💲"},
}

start_text = '''Доброго времени суток🙋🏻‍♂️
Хочешь понять систему RINGO TRADE?
И начать зарабатывать большие суммы?📈💵
Тогда ознакамливайся с конфиденциальностью📊
И начинай прямо сейчас📲'''


conf_text = '''Мы стремимся обеспечивать надежность и 
конфиденциальность. Ваших личных данных, а также вашего 
персонального и бизнес-информационного контента.🕴
Мы достигаем этого посредством установления 
и соблюдения высоких стандартов безопасности.🪪
Мы используем надежные стандарты шифрования 
для защиты личных данных, хранящихся на наших серверах.📶
Также мы используем защитные меры, чтобы защитить 
информацию от несанкционированного доступа, 
использования, изменения и раскрытия.🌐 
Также хочется упомянуть, компания не несёт 
ответственность за утерю денег❗️
Будьте внимательны и удачи вам в деятельности трейдера🤝🏼💸

УПОМИНАНИЕ❗️❗️❗️: «Организация коммерческая,соблюдайте правила и стандарты нашей конторы»✅
'''


send_request_text = """Если вы согласны с условиями конфиденциальности 📚
Просмотрите часто задаваемые вопросы✅
И подпишитесь на наш INSTAGRAM📝

Оставляй «Отправить запрос📨» и наши наставники с тобой обязательно свяжутся👨‍🏫✅"""